
* Revised version

** Ref report
[[file:mnras_19_2332_MJ_report_v01.pdf]]

** Initial comments on report

: The big problem with this paper is the lack of a clear purpose. After reading it, my main question is: “What does this tell us?”
: 
: The authors have introduced a classification scheme for bow shocks/waves and are now fitting existing observations of shells into this scheme. But why? What does this classification scheme give us? How does it help? Perhaps this was explained more clearly in previous papers, but we need to see at least a summary here, because as it is presented now, in this paper, the exercise seems pointless.
: 
: For example: In the paper by Cox et al 2012, which the authors cite, a classification scheme was introduced in an attempt to determine the interactions that shape the shell: fast moving star, slow- moving star, stationary star, etc. Similar arguments lay behind various other classification schemes for circumstellar shells that labeled them as bipolar, monopolar, ellipsoid etc. Here that does not seem to be the case. The hot and cold star shells occupy adjacent positions that tend to overlap and the young stars are spread over such a wide area that identification is almost impossible.  Perhaps this kind of differentiation make it possible to determine the nature of the progenitor star based upon a shell’s position within the classification scheme, but is that really useful? Direct observation of the star seems a more effective method.  So, I ask again, what do we gain from this new system and all the work that has gone in to automating the classification process? The authors have made an attempt to draw some conclusions from the way these starts fit within their classification scheme, but the results are either inconclusive or already known. E.g.
: 
: • One of the main ‘conclusions’ seems to be that bow shocks of OB stars are highly diverse owing to hydrodynamical instabilities in the shell. True, but that is common knowledge, and has been since the ’90s.
: 
: • The ‘young star shells’ are also extremely diverse. Again, not a surprise as they have asymmetrical winds and tend to exist in the highly diverse environment of a stellar nursery. No classification system based on two parameters is going to effectively capture the influence of so many independent variables.
: 
: To summarize: In this paper, the authors take previously published observations of bowshock shells and try to classify them with a previously published classification scheme. The results are, by and large, inconclusive. As such, I am unsure whether the paper contains a sufficient amount of original content to warrant publication. Instead it appears to be a lengthy exercise that requires a great deal of effort to re-shuffle existing data without actually achieving something.
: 
: There are other issues with this paper as well, but without a clearly defined purpose I cannot fully judge how serious they are. Still, the authors need to look at the following:
: 
: • The title is a problem: “Bow shocks, bow waves and dust waves.” Except neither bow waves or dust waves are mentioned anywhere in the text. I understand that the authors see this paper as one in a series, but as it is, the title is deceptive. Are some of the shells discussed in this paper either bow waves or dust waves? If so, that needs to be stated explicitly and discussed. If not, the problem can be fixed at least somewhat by rewriting the extended title to emphasize ‘bowshocks’, rather than the generic ‘shells’.
:  
: • Regarding timescales: The authors claim that it is safe to assume that observed bowshocks are fully formed, because the formation time is small compared to the total lifetime, based on Mohammed et al. 2012 and Marle et al. 2014. Although these papers give an indication as to the timescale at which a bowshock forms, this is inevitably going to depend on the interstellar medium density. This is particularly important for stars with a low wind velocity: If they travel through a low density medium, it will take a long time to form the bow shock, simply because it will take a long time for the stellar wind to travel the distance to R_0, let alone reach a hydrodynamical equilibrium. Is that included in the time-estimate?
: 
: • Something that does not get mentioned in this paper but may well be of paramount importance is the separation between dust and gas concentrations. The analytical/numerical models of bowshocks predict the morphology of the gas. However, van Marle et al. 2011 (2011ApJ...734L..26V) showed that the dust distribution in space may not follow the gas distribution for a red supergiant bowshock and van Marle et al. 2015 (2015JPhCS.577a2024V) showed something similar for an O-star. This limits the reliability of mid/far infrared continuum observations for tracing bow shocks.
: 
: • Another issue that receives no mention in this paper is the influence of the interstellar magnetic field, which can change the shape of the bow shock. Arnal 1992 already discussed the potential influence of interstellar magnetic fields on circumstellar bubbles and it was shown numerically in papers such as van Marle et al. 2014, which the authors quote elsewhere.



* Initial version

** Use ~latexexpand~ to make a single ~.tex~ file
+ We also find the figure files using grep

#+name: figfiles
#+begin_src sh :results verbatim
  cd ../Papers1234/
  latexpand obs-bowshocks.tex \
      --verbose --explain \
      --expand-bbl obs-bowshocks.bbl \
      --show-graphics \
      -o bsbwdw-04-v1-expand.tex
  grep '{figs/' bsbwdw-04-v1-expand.tex |grep -v :% |cut -d{ -f2 | cut -d} -f1 > figlist04.txt
  cat figlist04.txt | tr '\n' '@' | sed -e 's/@/.pdf /g' | sed -e 's/annotated-ll-arcs\.pdf/annotated-ll-arcs.jpg/' 
#+end_src

#+RESULTS: figfiles
: figs/obs-shape-terminology.pdf figs/mipsgal-example-panels.pdf figs/mipsgal-Rc-R90-zoom-annotated.pdf figs/mipsgal-Rc-R90-thumbnails.pdf figs/mipsgal-pairplot.pdf figs/mipsgal-Rc-R90-environment.pdf figs/mipsgal-Rc-R90-candidates.pdf figs/mipsgal-Rc-R90-R0.pdf figs/mipsgal-Rc-R90-Mag.pdf figs/mipsgal-boxplot-Rc-R90-versus-R0.pdf figs/alphaori-imageplot.pdf figs/mucep-imageplot.pdf figs/rhya-imageplot.pdf figs/rleo-imageplot.pdf figs/uuaur-imageplot.pdf figs/v1943sgr-imageplot.pdf figs/xpav-imageplot.pdf figs/rcas-imageplot.pdf figs/cwleo-imageplot.pdf figs/epaqr-imageplot.pdf figs/khicyg-imageplot.pdf figs/rtvir-imageplot.pdf figs/waql-imageplot.pdf figs/wpic-imageplot.pdf figs/rscl-imageplot.pdf figs/tetaps-imageplot.pdf figs/mipsgal-Rc-R90-vs-Herschel.pdf figs/annotated-ll-arcs.jpg figs/mipsgal-Rc-R90-vs-Orion-R0-D.pdf figs/wave-R90-vs-Rc-A020-N10.pdf figs/wave-R90-vs-Rc-A010-N20.pdf figs/p-value-histogram-new-linear.pdf figs/p-value-histogram-new.pdf figs/compare_xyprime_wave-wilkinoid.pdf figs/wave_xyprime-A010-N20-ancantoid-xi080-beta000500.pdf 


** List files and look at sizes
#+name: files
#+begin_src sh
files="bsbwdw-04-v1-expand.tex aastex-compat.sty"
#+end_src

#+BEGIN_SRC sh :noweb yes :var input=figfiles :results verbatim
  <<files>>
  cd ../Papers1234
  ls -lh  $files $input
#+END_SRC

#+RESULTS:
#+begin_example
-rw-rw-r--  1 will  staff   1.4K Apr 15  2013 aastex-compat.sty
-rw-r--r--  1 will  staff   125K Jul  1 10:33 bsbwdw-04-v1-expand.tex
-rw-rw-r--@ 1 will  staff   704K Jun  8  2017 figs/alphaori-imageplot.pdf
-rw-r--r--@ 1 will  staff   419K Jul  1 10:24 figs/annotated-ll-arcs.jpg
-rw-r--r--  1 will  staff    22K Jun 21 23:07 figs/compare_xyprime_wave-wilkinoid.pdf
-rw-rw-r--@ 1 will  staff   386K Jul  5  2017 figs/cwleo-imageplot.pdf
-rw-rw-r--@ 1 will  staff   224K Jul  5  2017 figs/epaqr-imageplot.pdf
-rw-rw-r--@ 1 will  staff   297K Jul  5  2017 figs/khicyg-imageplot.pdf
-rw-r--r--  1 will  staff   109K Jun 27 23:17 figs/mipsgal-Rc-R90-Mag.pdf
-rw-r--r--  1 will  staff   111K Jun 27 23:14 figs/mipsgal-Rc-R90-R0.pdf
-rw-r--r--  1 will  staff   108K Jun 27 23:12 figs/mipsgal-Rc-R90-candidates.pdf
-rw-r--r--  1 will  staff   115K Jun 27 23:09 figs/mipsgal-Rc-R90-environment.pdf
-rw-r--r--@ 1 will  staff   1.0M Jul  1 10:33 figs/mipsgal-Rc-R90-thumbnails.pdf
-rw-r--r--  1 will  staff   101K Jun 21 23:07 figs/mipsgal-Rc-R90-vs-Herschel.pdf
-rw-r--r--  1 will  staff   105K Jun 21 23:07 figs/mipsgal-Rc-R90-vs-Orion-R0-D.pdf
-rw-r--r--  1 will  staff   274K Jun 21 23:07 figs/mipsgal-Rc-R90-zoom-annotated.pdf
-rw-r--r--  1 will  staff    24K Jun 21 23:07 figs/mipsgal-boxplot-Rc-R90-versus-R0.pdf
-rw-r--r--  1 will  staff   685K Jun 27 13:23 figs/mipsgal-example-panels.pdf
-rw-rw-r--@ 1 will  staff   130K Apr  3  2017 figs/mipsgal-pairplot.pdf
-rw-rw-r--@ 1 will  staff   413K Jun  8  2017 figs/mucep-imageplot.pdf
-rw-r--r--  1 will  staff    85K Jun 21 23:07 figs/obs-shape-terminology.pdf
-rw-r--r--  1 will  staff    19K Jun 21 23:07 figs/p-value-histogram-new-linear.pdf
-rw-r--r--  1 will  staff    21K Jun 21 23:07 figs/p-value-histogram-new.pdf
-rw-rw-r--@ 1 will  staff   580K Jul  5  2017 figs/rcas-imageplot.pdf
-rw-rw-r--@ 1 will  staff   577K Jun  8  2017 figs/rhya-imageplot.pdf
-rw-rw-r--@ 1 will  staff   535K Jun  8  2017 figs/rleo-imageplot.pdf
-rw-rw-r--@ 1 will  staff   183K Jul  5  2017 figs/rscl-imageplot.pdf
-rw-rw-r--@ 1 will  staff   557K Jul  5  2017 figs/rtvir-imageplot.pdf
-rw-rw-r--@ 1 will  staff   368K Jul  5  2017 figs/tetaps-imageplot.pdf
-rw-rw-r--@ 1 will  staff   592K Jun  8  2017 figs/uuaur-imageplot.pdf
-rw-rw-r--@ 1 will  staff   278K Jun  8  2017 figs/v1943sgr-imageplot.pdf
-rw-rw-r--@ 1 will  staff   159K Jul  5  2017 figs/waql-imageplot.pdf
-rw-r--r--  1 will  staff   171K Jun 21 23:07 figs/wave-R90-vs-Rc-A010-N20.pdf
-rw-r--r--  1 will  staff   170K Jun 21 23:07 figs/wave-R90-vs-Rc-A020-N10.pdf
-rw-r--r--  1 will  staff    29K Jun 21 23:07 figs/wave_xyprime-A010-N20-ancantoid-xi080-beta000500.pdf
-rw-rw-r--@ 1 will  staff   140K Jul  5  2017 figs/wpic-imageplot.pdf
-rw-rw-r--@ 1 will  staff   273K Jun  8  2017 figs/xpav-imageplot.pdf
#+end_example

** Make tar file to submit

#+BEGIN_SRC sh :noweb yes :var input=figfiles :results verbatim
  <<files>>
  cd ../Papers1234
  tar cvzf $OLDPWD/ms-bsbwdw04-v1.tar.gz $files $input
  cd -
  ls -lh
#+END_SRC

#+RESULTS:
: /Users/will/Work/Bowshocks/Jorge/bowshock-shape/papers/bs-bw-dw-04-submit
: total 120184
: -rw-r--r--  1 will  staff    10K Jun 28 20:22 bs-bw-dw-04-submit.org
: -r--------@ 1 will  staff    14M Jun 28 20:03 bsbwdw04-v1-arxiv.pdf
: -r--------@ 1 will  staff    14M Jun 28 19:45 bsbwdw04-v1-processed.pdf
: -rw-r--r--@ 1 will  staff    11M Jul  1 10:30 ms-bsbwdw04-compressed.pdf
: -rw-r--r--  1 will  staff   8.7M Jul  1 10:39 ms-bsbwdw04-v1.tar.gz
: -rw-r--r--@ 1 will  staff   9.9M Jul  1 10:35 ms-bsbwdw04.pdf


* Test compilation in a temp folder
#+BEGIN_SRC bash :results verbatim
  TMPDIR=/tmp/ms-bsbwdw04-test
  if test -e $TMPDIR; then
      echo "$TMPDIR found and removed"
      rm -fr $TMPDIR
  else
      echo "$TMPDIR not found"
  fi
  mkdir -p $TMPDIR
  cd $TMPDIR
  pwd
  tar xzf $OLDPWD/ms-bsbwdw04-v1.tar.gz
  ls -lhR
#+END_SRC

#+RESULTS:
#+begin_example
/tmp/ms-bsbwdw04-test found and removed
/tmp/ms-bsbwdw04-test
total 264
-rw-r--r--   1 will  wheel   1.4K Apr 15  2013 aastex-compat.sty
-rw-r--r--   1 will  wheel   125K Jul  1 10:39 bsbwdw-04-v1-expand.tex
drwxr-xr-x  37 will  wheel   1.2K Jul  1 10:39 figs

./figs:
total 18992
-rw-r--r--@ 1 will  wheel    92K Jul  1 10:38 alphaori-imageplot.pdf
-rw-r--r--@ 1 will  wheel   419K Jul  1 10:24 annotated-ll-arcs.jpg
-rw-r--r--  1 will  wheel    22K Jun 21 23:07 compare_xyprime_wave-wilkinoid.pdf
-rw-r--r--@ 1 will  wheel   386K Jul  5  2017 cwleo-imageplot.pdf
-rw-r--r--@ 1 will  wheel   224K Jul  5  2017 epaqr-imageplot.pdf
-rw-r--r--@ 1 will  wheel   297K Jul  5  2017 khicyg-imageplot.pdf
-rw-r--r--  1 will  wheel   109K Jun 27 23:17 mipsgal-Rc-R90-Mag.pdf
-rw-r--r--  1 will  wheel   111K Jun 27 23:14 mipsgal-Rc-R90-R0.pdf
-rw-r--r--  1 will  wheel   108K Jun 27 23:12 mipsgal-Rc-R90-candidates.pdf
-rw-r--r--  1 will  wheel   115K Jun 27 23:09 mipsgal-Rc-R90-environment.pdf
-rw-r--r--@ 1 will  wheel   1.0M Jul  1 10:35 mipsgal-Rc-R90-thumbnails.pdf
-rw-r--r--  1 will  wheel   101K Jun 21 23:07 mipsgal-Rc-R90-vs-Herschel.pdf
-rw-r--r--  1 will  wheel   105K Jun 21 23:07 mipsgal-Rc-R90-vs-Orion-R0-D.pdf
-rw-r--r--  1 will  wheel   274K Jun 21 23:07 mipsgal-Rc-R90-zoom-annotated.pdf
-rw-r--r--  1 will  wheel    24K Jun 21 23:07 mipsgal-boxplot-Rc-R90-versus-R0.pdf
-rw-r--r--  1 will  wheel   685K Jun 27 13:23 mipsgal-example-panels.pdf
-rw-r--r--@ 1 will  wheel   130K Apr  3  2017 mipsgal-pairplot.pdf
-rw-r--r--@ 1 will  wheel   413K Jun  8  2017 mucep-imageplot.pdf
-rw-r--r--  1 will  wheel    85K Jun 21 23:07 obs-shape-terminology.pdf
-rw-r--r--  1 will  wheel    19K Jun 21 23:07 p-value-histogram-new-linear.pdf
-rw-r--r--  1 will  wheel    21K Jun 21 23:07 p-value-histogram-new.pdf
-rw-r--r--@ 1 will  wheel   580K Jul  5  2017 rcas-imageplot.pdf
-rw-r--r--@ 1 will  wheel   577K Jun  8  2017 rhya-imageplot.pdf
-rw-r--r--@ 1 will  wheel   535K Jun  8  2017 rleo-imageplot.pdf
-rw-r--r--@ 1 will  wheel   183K Jul  5  2017 rscl-imageplot.pdf
-rw-r--r--@ 1 will  wheel   557K Jul  5  2017 rtvir-imageplot.pdf
-rw-r--r--@ 1 will  wheel   368K Jul  5  2017 tetaps-imageplot.pdf
-rw-r--r--@ 1 will  wheel   592K Jun  8  2017 uuaur-imageplot.pdf
-rw-r--r--@ 1 will  wheel   278K Jun  8  2017 v1943sgr-imageplot.pdf
-rw-r--r--@ 1 will  wheel   159K Jul  5  2017 waql-imageplot.pdf
-rw-r--r--  1 will  wheel   171K Jun 21 23:07 wave-R90-vs-Rc-A010-N20.pdf
-rw-r--r--  1 will  wheel   170K Jun 21 23:07 wave-R90-vs-Rc-A020-N10.pdf
-rw-r--r--  1 will  wheel    29K Jun 21 23:07 wave_xyprime-A010-N20-ancantoid-xi080-beta000500.pdf
-rw-r--r--@ 1 will  wheel   140K Jul  5  2017 wpic-imageplot.pdf
-rw-r--r--@ 1 will  wheel   273K Jun  8  2017 xpav-imageplot.pdf
#+end_example

#+BEGIN_SRC sh 
  TMPDIR=/tmp/ms-bsbwdw04-test
  cd $TMPDIR
  pdflatex bsbwdw-04-v1-expand
  pdflatex bsbwdw-04-v1-expand
  cp bsbwdw-04-v1-expand.pdf $OLDPWD/ms-bsbwdw04.pdf
#+END_SRC

#+RESULTS:

#+BEGIN_SRC sh :results silent
open ms-bsbwdw04.pdf
#+END_SRC


** DONE Upload to MNRAS website
CLOSED: [2019-06-28 Fri 19:56]
Bow shocks, bow waves, and dust waves. IV. Shell shape statistics

+ [[file:bsbwdw04-v1-processed.pdf]]

** Upload to arxiv
#+begin_example
  Stellar bow shocks result from relative motions between stars and their environment. The interaction of the stellar wind and radiation with gas and dust in the interstellar medium produces curved arcs of emission at optical, infrared, and radio wavelengths. We recently proposed a new two-dimensional classification scheme for the shape of such bow shocks, which we here apply to three very different observational datasets: mid-infrared arcs around hot OB stars; far-infrared arcs around luminous cool stars; and H alpha emission-line arcs around proplyds and other young stars in the Orion Nebula. For OB stars, the average shape is consistent with simple thin-shell models for the interaction of a spherical wind with a parallel stream, but the diversity of observed shapes is many times larger than such models predict. We propose that this may be caused by time-dependent oscillations in the bow shocks, due to either instabilities or wind variability. Cool star bow shocks have markedly more closed wings than hot star bow shocks, which may be due to the dust emission arising in the shocked stellar wind instead of the shocked interstellar medium. The Orion Nebula arcs, on the other hand, have both significantly more open wings and significantly flatter apexes than the hot star bow shocks. We test several possible explanations for this difference (divergent ambient stream, low Mach number, observational biases, and influence of collimated jets), but the evidence for each is inconclusive.
#+end_example
